Tecnologia/Support Tècnic/28705191.md

Suport Tècnic : PSCP - FLUX DEL SERVEI - COMUNICACIÓ - Flux que segueix una petició. (Error amb estat 998)  

1.  [Suport Tècnic](index.md)
2.  [Suport Tècnic](13893782.md)
3.  [02 - FAQ's serveis](26313393.md)
4.  [FAQ's PSCP i eLICITA](28705587.md)
5.  [OLD - PSCP](OLD---PSCP_93356826.md)

Suport Tècnic : PSCP - FLUX DEL SERVEI - COMUNICACIÓ - Flux que segueix una petició. (Error amb estat 998)
==========================================================================================================

Created by Unknown User (otecjriquelme), last modified by Unknown User (oteccmorales) on 13 August 2020

S'explicarà el flux d'estats que segueixen les peticions de PSCP, ja que és un servei amb un funcionament una mica diferent.

  

Gràficament:

![](attachments/28705191/28705192.png)

  

Les peticions arriben amb un estat 900 i a partir d'aqui en general tenim dos possibles camins: 901 o 998. 

IMPORTANT: la resposta a nivell de missatgeria XML es retorna de manera síncrona, tot i que l'estat de la petició canviï amb posterioritat (seguint el flux del gràfic i que s'explicarà) el requeridor rebrà com a resposta XML el primer estat en que hagi acabat la petició.

ESTAT 901: La petició ha estat tractada correctament a nivell de l'AOC i s'ha invocat a la PSCP (l'**AOC tan sols fa d'intermediari**). A partir d'aqui, la petició seguirà el flux que li toqui intern a la PSCP. Per la banda de l'aoc s'executaran uns callbacks per anar actualitzant l'estat de la publicació d'acord amb l'estat que tingui a la PSCP.

  

ESTAT 998: La petició ha quedat en un error **RECUPERABLE** (aquest estat mai serà un estat definitiu). Si, pel que sigui, falla la invocació a la PSCP, la aplicació de l'AOC seguirà una política de re-intents, i la publicació quedarà en estat 998.

Aquest estat podrà evolucionar en un 999 (error irrecuperable, estat final) o bé en un 901 si finalment s'aconsegueix invocar la PSCP.

Aquest flux d'estats pot portar confusió als integradors. En cas que la invocació a la PSCP falli en primera instància, la resposta a nivell de missatgeria XML serà un 998 (error). L'integrador no tornarà a tenir més notícies sobre aquella petició. **No se li enviaran callbacks de canvis d'estat. HAN DE DEMANAR-SE EXPLÍCITAMENT AMB UNA NOVA PETICIÓ.**

### Com demanar l'estat en què es troba una publicació?

Per saber en quins estats ha evolucionat una publicació, existeix la crida XML de Consulta de Publicació. Amb la qual es retorna l'històric d'estats pels quals ha passat una publicació.

A nivell de missatgeria XML, consultant pel DNI que ha publicat i el num. d'expedient:

**Crida de Consulta de Publicació (A nivell de Soap UI)** Expand source

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <procesa xmlns="http://www.openuri.org/">
         <ns1:Peticion xmlns:ns1="http://gencat.net/scsp/esquemes/peticion">
            <ns1:Atributos>
               <ns1:IdPeticion>PROVA\_000</ns1:IdPeticion>
               <ns1:NumElementos>1</ns1:NumElementos>
               <ns1:TimeStamp>2019-05-28 09:05:58.05</ns1:TimeStamp>
               <ns1:Estado/>
               <ns1:CodigoCertificado>PSCP</ns1:CodigoCertificado>
               <ns1:CodigoProducto>PSCP</ns1:CodigoProducto>
               <ns1:DatosAutorizacion>
                  <ns1:IdentificadorSolicitante>XXXXXXXXX</ns1:IdentificadorSolicitante>
                  <ns1:NombreSolicitante>XXXXXXXXXX</ns1:NombreSolicitante>
                  <ns1:Finalidad>PROVES</ns1:Finalidad>
               </ns1:DatosAutorizacion>
               <ns1:Emisor>
                  <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                  <ns1:NombreEmisor>CAOC</ns1:NombreEmisor>
               </ns1:Emisor>
               <ns1:Funcionario>
                  <ns1:NombreCompletoFuncionario>VILA VILA GEMMA</ns1:NombreCompletoFuncionario>
                  <ns1:NifFuncionario>33943264W</ns1:NifFuncionario>
               </ns1:Funcionario>
            </ns1:Atributos>
            <ns1:Solicitudes>
               <ns1:SolicitudTransmision>
                  <ns1:DatosGenericos>
                     <ns1:Emisor>
                        <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                        <ns1:NombreEmisor>CAOC</ns1:NombreEmisor>
                     </ns1:Emisor>
                     <ns1:Solicitante>
                        <ns1:IdentificadorSolicitante>829810007</ns1:IdentificadorSolicitante>
                        <ns1:NombreSolicitante>Ajuntament de Vic</ns1:NombreSolicitante>
                        <ns1:Finalidad>PROVES</ns1:Finalidad>
                        <ns1:Consentimiento>Si</ns1:Consentimiento>
                        <ns1:Funcionario>
                           <ns1:NombreCompletoFuncionario>VILA VILA GEMMA</ns1:NombreCompletoFuncionario>
                           <ns1:NifFuncionario>33943264W</ns1:NifFuncionario>
                        </ns1:Funcionario>
                     </ns1:Solicitante>
                     <ns1:Transmision>
                        <ns1:CodigoCertificado>PSCP</ns1:CodigoCertificado>
                        <ns1:IdSolicitud>829810007\_PSCP\_190528090558.59608</ns1:IdSolicitud>
                        <ns1:IdTransmision>472019</ns1:IdTransmision>
                     </ns1:Transmision>
                  </ns1:DatosGenericos>
                  <ns1:DatosEspecificos>
                     <pscpPublicationStatus xmlns="http://cat.aoc/pscp">
                        <publisherId xsi:type="xsd:string">YYYYYYYYY</publisherId>
                        <diligenceId xsi:type="xsd:string">XXXXXXXX</diligenceId>
                     </pscpPublicationStatus>
                  </ns1:DatosEspecificos>
               </ns1:SolicitudTransmision>
            </ns1:Solicitudes>
         </ns1:Peticion>
      </procesa>
   </s:Body>
</s:Envelope>

  

### Exemple d'incidència

En el tiquet 304567 l'integrador ens indicava:

1.  La resposta XML que m'arriba és un error 998
2.  Al cap d'una estona miro la plataforma de PSCP i veig la publicació

El que passa és que internament s'ha seguit una política de reintents i l'estat de la publicació ha anat canviant, sense que l'integrador ho sabés.

Per saber l'estat de la publicació i el flux d'estats que ha seguit, l'integrador ha de llençar una petició del tipus CONSULTA ESTAT PUBLICACIO. 

  

Attachments:
------------

![](images/icons/bullet_blue.gif) [image2019-10-9\_12-45-54.png](attachments/28705191/28705192.png) (image/png)  

Document generated by Confluence on 02 June 2025 10:58

[Atlassian](http://www.atlassian.com/)